podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/IOCON_LPC11xx.svd.xml
            <register>
               <name>IOCON_SCK0_LOC</name>
               <description>SCK0 pin location select register</description>
               <addressOffset>0xB0</addressOffset>
               <fields>
                  <field>
                     <name>SCKLOC</name>
                     <description>Selects pin location for SCK0 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_SCK0_FUNCTIO</name>
                           <description>Selects SCK0 function in pin location SWCLK/PIO0_10/SCK0/CT16B0_MAT2 (see Table 129)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_SCK0_FUNCTIO</name>
                           <description>Selects SCK0 function in pin location PIO2_11/SCK0 (see Table 131)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_SCK0_FUNCTIO</name>
                           <description>Selects SCK0 function in pin location PIO0_6/SCK0 (see Table 122)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_DSR_LOC</name>
               <description>DSR pin location select register</description>
               <addressOffset>0xB4</addressOffset>
               <fields>
                  <field>
                     <name>DSRLOC</name>
                     <description>Selects pin location for DSR function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_DSR_FUNCTIO</name>
                           <description>Selects  DSR function in pin location PIO2_1/DSR/SCK1 (see Table 113)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_DSR_FUNCTION</name>
                           <description>Selects DSR function in pin location PIO3_1/DSR (see Table 137)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_DCD_LOC</name>
               <description>DCD pin location select register</description>
               <addressOffset>0xB8</addressOffset>
               <fields>
                  <field>
                     <name>DCDLOC</name>
                     <description>Selects pin location for DCD function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_DCD_FUNCTIO</name>
                           <description>Selects  DCD function in pin location PIO2_2/DCD/MISO1 (see  Table 126)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_DCD_FUNCTION</name>
                           <description>Selects DCD function in pin location PIO3_2/DCD (see  Table 142)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_RI_LOC</name>
               <description>RI pin location select register</description>
               <addressOffset>0xBC</addressOffset>
               <fields>
                  <field>
                     <name>RILOC</name>
                     <description>Selects pin location for RI function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_RI_FUNCTION</name>
                           <description>Selects  RI function in pin location PIO2_3/RI/MOSI1 (see Table 138)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_RI_FUNCTION_</name>
                           <description>Selects RI function in pin location PIO3_3/RI (see Table 146)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_CT16B0_CAP0_LOC</name>
               <description>CT16B0_CAP0 pin location select register</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>CT16B0_CAP0LOC</name>
                     <description>Selects pin location for CT16B0_CAP0 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_CT16B0_CAP0_</name>
                           <description>Selects CT16B0_CAP0 function in pin location PIO0_2/SSEL0/CT16B0_CAP0 (see  Table 110)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_CT16B0_CAP0_</name>
                           <description>Selects CT16B0_CAP0 function in pin location PIO3_3/RI/CT16B0 (see Table 146)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_SCK1_LOC</name>
               <description>SCK1 pin location select register</description>
               <addressOffset>0xC4</addressOffset>
               <fields>
                  <field>
                     <name>SCK1LOC</name>
                     <description>Selects pin location for SCK1 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_SCK1_FUNCTIO</name>
                           <description>Selects SCK1 function in pin location PIO2_1/DSR/SCK1 (see Table 113)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_SCK1_FUNCTIO</name>
                           <description>Selects SCK1 function in pin location PIO3_2/DCD/CT16B0_MAT2/SCK1 (see Table 142)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_MISO1_LOC</name>
               <description>MISO1 pin location select register</description>
               <addressOffset>0xC8</addressOffset>
               <fields>
                  <field>
                     <name>MISO1LOC</name>
                     <description>Selects pin location for the MISO1 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_MISO1_FUNCTI</name>
                           <description>Selects MISO1 function in pin location PIO2_2/DCD/MISO1 (see Table 126)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_MISO1_FUNCTI</name>
                           <description>Selects MISO1 function in pin location PIO1_10/AD6/CT16B1_MAT1/MISO1 (see  Table 130)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_MOSI1_LOC</name>
               <description>MOSI1 pin location select register</description>
               <addressOffset>0xCC</addressOffset>
               <fields>
                  <field>
                     <name>MOSI1LOC</name>
                     <description>Selects pin location for the MOSI1 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_MOSI1_FUNCTI</name>
                           <description>Selects MOSI1 function in pin location PIO2_3/RI/MOSI1 (see Table 138)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_MOSI1_FUNCTI</name>
                           <description>Selects MOSI1 function in pin location PIO1_9/CT16B1_MAT0/MOSI1 (see Table 117)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_CT32B0_CAP0_LOC</name>
               <description>CT32B0_CAP0 pin location select register</description>
               <addressOffset>0xD0</addressOffset>
               <fields>
                  <field>
                     <name>CT32B0_CAP0LOC</name>
                     <description>Selects pin location for the CT32B0_CAP0 function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_CT32B0_CAP0_</name>
                           <description>Selects CT32B0_CAP0 function in pin location PIO1_5/RTS/CT32B0_CAP0 (see Table 143)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_CT32B0_CAP0_</name>
                           <description>Selects CT32B0_CAP0 function in pin location PIO2_9/CT32B0_CAP0 (Table 124)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED_</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCON_RXD_LOC</name>
               <description>RXD pin location select register</description>
               <addressOffset>0xD4</addressOffset>
               <fields>
                  <field>
                     <name>RXDLOC</name>
                     <description>Selects pin location for the RXD function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SELECTS_RXD_FUNCTION</name>
                           <description>Selects RXD function in pin location PIO1_6/RXD/CT32B0_MAT0 (see Table 144)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_RXD_FUNCTION</name>
                           <description>Selects RXD function in pin location PIO2_7/CT32B0_MAT2/RXD (see Table 111)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_RXD_FUNCTION</name>
                           <description>Selects RXD function in pin location PIO3_1/DSR/CT16B0_MAT1/RXD (see Table 137)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTS_RXD_FUNCTION</name>
                           <description>Selects RXD function in pin location PIO3_4/CT16B0_CAP1/RXD (see Table 118)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
